MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K22/mcu.h
// Register: VREFCON2
#define VREFCON2 VREFCON2
extern volatile unsigned char           VREFCON2            __at(0xF40);
#ifndef _LIB_BUILD
asm("VREFCON2 equ 0F40h");
#endif
// aliases
extern volatile unsigned char           DACCON1             __at(0xF40);
#ifndef _LIB_BUILD
asm("DACCON1 equ 0F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
} VREFCON2bits_t;
extern volatile VREFCON2bits_t VREFCON2bits __at(0xF40);
// bitfield macros
#define _VREFCON2_DACR_POSN                                 0x0
#define _VREFCON2_DACR_POSITION                             0x0
#define _VREFCON2_DACR_SIZE                                 0x5
#define _VREFCON2_DACR_LENGTH                               0x5
#define _VREFCON2_DACR_MASK                                 0x1F
#define _VREFCON2_DACR0_POSN                                0x0
#define _VREFCON2_DACR0_POSITION                            0x0
#define _VREFCON2_DACR0_SIZE                                0x1
#define _VREFCON2_DACR0_LENGTH                              0x1
#define _VREFCON2_DACR0_MASK                                0x1
#define _VREFCON2_DACR1_POSN                                0x1
#define _VREFCON2_DACR1_POSITION                            0x1
#define _VREFCON2_DACR1_SIZE                                0x1
#define _VREFCON2_DACR1_LENGTH                              0x1
#define _VREFCON2_DACR1_MASK                                0x2
#define _VREFCON2_DACR2_POSN                                0x2
#define _VREFCON2_DACR2_POSITION                            0x2
#define _VREFCON2_DACR2_SIZE                                0x1
#define _VREFCON2_DACR2_LENGTH                              0x1
#define _VREFCON2_DACR2_MASK                                0x4
#define _VREFCON2_DACR3_POSN                                0x3
#define _VREFCON2_DACR3_POSITION                            0x3
#define _VREFCON2_DACR3_SIZE                                0x1
#define _VREFCON2_DACR3_LENGTH                              0x1
#define _VREFCON2_DACR3_MASK                                0x8
#define _VREFCON2_DACR4_POSN                                0x4
#define _VREFCON2_DACR4_POSITION                            0x4
#define _VREFCON2_DACR4_SIZE                                0x1
#define _VREFCON2_DACR4_LENGTH                              0x1
#define _VREFCON2_DACR4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
} DACCON1bits_t;
extern volatile DACCON1bits_t DACCON1bits __at(0xF40);
// bitfield macros
#define _DACCON1_DACR_POSN                                  0x0
#define _DACCON1_DACR_POSITION                              0x0
#define _DACCON1_DACR_SIZE                                  0x5
#define _DACCON1_DACR_LENGTH                                0x5
#define _DACCON1_DACR_MASK                                  0x1F
#define _DACCON1_DACR0_POSN                                 0x0
#define _DACCON1_DACR0_POSITION                             0x0
#define _DACCON1_DACR0_SIZE                                 0x1
#define _DACCON1_DACR0_LENGTH                               0x1
#define _DACCON1_DACR0_MASK                                 0x1
#define _DACCON1_DACR1_POSN                                 0x1
#define _DACCON1_DACR1_POSITION                             0x1
#define _DACCON1_DACR1_SIZE                                 0x1
#define _DACCON1_DACR1_LENGTH                               0x1
#define _DACCON1_DACR1_MASK                                 0x2
#define _DACCON1_DACR2_POSN                                 0x2
#define _DACCON1_DACR2_POSITION                             0x2
#define _DACCON1_DACR2_SIZE                                 0x1
#define _DACCON1_DACR2_LENGTH                               0x1
#define _DACCON1_DACR2_MASK                                 0x4
#define _DACCON1_DACR3_POSN                                 0x3
#define _DACCON1_DACR3_POSITION                             0x3
#define _DACCON1_DACR3_SIZE                                 0x1
#define _DACCON1_DACR3_LENGTH                               0x1
#define _DACCON1_DACR3_MASK                                 0x8
#define _DACCON1_DACR4_POSN                                 0x4
#define _DACCON1_DACR4_POSITION                             0x4
#define _DACCON1_DACR4_SIZE                                 0x1
#define _DACCON1_DACR4_LENGTH                               0x1
#define _DACCON1_DACR4_MASK                                 0x10

// Register: VREFCON1
#define VREFCON1 VREFCON1
extern volatile unsigned char           VREFCON1            __at(0xF41);
#ifndef _LIB_BUILD
asm("VREFCON1 equ 0F41h");
#endif
// aliases
extern volatile unsigned char           DACCON0             __at(0xF41);
#ifndef _LIB_BUILD
asm("DACCON0 equ 0F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE                  :1;
        unsigned DACLPS                 :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} VREFCON1bits_t;
extern volatile VREFCON1bits_t VREFCON1bits __at(0xF41);
// bitfield macros
#define _VREFCON1_DACNSS_POSN                               0x0
#define _VREFCON1_DACNSS_POSITION                           0x0
#define _VREFCON1_DACNSS_SIZE                               0x1
#define _VREFCON1_DACNSS_LENGTH                             0x1
#define _VREFCON1_DACNSS_MASK                               0x1
#define _VREFCON1_DACPSS_POSN                               0x2
#define _VREFCON1_DACPSS_POSITION                           0x2
#define _VREFCON1_DACPSS_SIZE                               0x2
#define _VREFCON1_DACPSS_LENGTH                             0x2
#define _VREFCON1_DACPSS_MASK                               0xC
#define _VREFCON1_DACOE_POSN                                0x5
#define _VREFCON1_DACOE_POSITION                            0x5
#define _VREFCON1_DACOE_SIZE                                0x1
#define _VREFCON1_DACOE_LENGTH                              0x1
#define _VREFCON1_DACOE_MASK                                0x20
#define _VREFCON1_DACLPS_POSN                               0x6
#define _VREFCON1_DACLPS_POSITION                           0x6
#define _VREFCON1_DACLPS_SIZE                               0x1
#define _VREFCON1_DACLPS_LENGTH                             0x1
#define _VREFCON1_DACLPS_MASK                               0x40
#define _VREFCON1_DACEN_POSN                                0x7
#define _VREFCON1_DACEN_POSITION                            0x7
#define _VREFCON1_DACEN_SIZE                                0x1
#define _VREFCON1_DACEN_LENGTH                              0x1
#define _VREFCON1_DACEN_MASK                                0x80
#define _VREFCON1_DACPSS0_POSN                              0x2
#define _VREFCON1_DACPSS0_POSITION                          0x2
#define _VREFCON1_DACPSS0_SIZE                              0x1
#define _VREFCON1_DACPSS0_LENGTH                            0x1
#define _VREFCON1_DACPSS0_MASK                              0x4
#define _VREFCON1_DACPSS1_POSN                              0x3
#define _VREFCON1_DACPSS1_POSITION                          0x3
#define _VREFCON1_DACPSS1_SIZE                              0x1
#define _VREFCON1_DACPSS1_LENGTH                            0x1
#define _VREFCON1_DACPSS1_MASK                              0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE                  :1;
        unsigned DACLPS                 :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} DACCON0bits_t;
extern volatile DACCON0bits_t DACCON0bits __at(0xF41);
// bitfield macros
#define _DACCON0_DACNSS_POSN                                0x0
#define _DACCON0_DACNSS_POSITION                            0x0
#define _DACCON0_DACNSS_SIZE                                0x1
#define _DACCON0_DACNSS_LENGTH                              0x1
#define _DACCON0_DACNSS_MASK                                0x1
#define _DACCON0_DACPSS_POSN                                0x2
#define _DACCON0_DACPSS_POSITION                            0x2
#define _DACCON0_DACPSS_SIZE                                0x2
#define _DACCON0_DACPSS_LENGTH                              0x2
#define _DACCON0_DACPSS_MASK                                0xC
#define _DACCON0_DACOE_POSN                                 0x5
#define _DACCON0_DACOE_POSITION                             0x5
#define _DACCON0_DACOE_SIZE                                 0x1
#define _DACCON0_DACOE_LENGTH                               0x1
#define _DACCON0_DACOE_MASK                                 0x20
#define _DACCON0_DACLPS_POSN                                0x6
#define _DACCON0_DACLPS_POSITION                            0x6
#define _DACCON0_DACLPS_SIZE                                0x1
#define _DACCON0_DACLPS_LENGTH                              0x1
#define _DACCON0_DACLPS_MASK                                0x40
#define _DACCON0_DACEN_POSN                                 0x7
#define _DACCON0_DACEN_POSITION                             0x7
#define _DACCON0_DACEN_SIZE                                 0x1
#define _DACCON0_DACEN_LENGTH                               0x1
#define _DACCON0_DACEN_MASK                                 0x80
#define _DACCON0_DACPSS0_POSN                               0x2
#define _DACCON0_DACPSS0_POSITION                           0x2
#define _DACCON0_DACPSS0_SIZE                               0x1
#define _DACCON0_DACPSS0_LENGTH                             0x1
#define _DACCON0_DACPSS0_MASK                               0x4
#define _DACCON0_DACPSS1_POSN                               0x3
#define _DACCON0_DACPSS1_POSITION                           0x3
#define _DACCON0_DACPSS1_SIZE                               0x1
#define _DACCON0_DACPSS1_LENGTH                             0x1
#define _DACCON0_DACPSS1_MASK                               0x8

